
#!/bin/bash
##############################################################################
### 			没有任何修饰符参数 : 原生参数
### 			<>  : 占位参数
### 			[]  : 可选组合
### 			()  : 必选组合
### 			|   : 互斥参数
### 			... : 可重复指定前一个参数
### 			--  : 标记后续参数类型
##############################################################################


##############################################################################
###			显示帮助
##############################################################################
function show_help(){
	echo
	echo "usage: batb [Options]"
	echo
	echo "Options："
	echo " -c                              clean 工程"
	echo " -du  [ -l ]                     跳过编译步骤直接上传已存在war包到本地服务器"
	echo " -du -r <server_flag>            跳过编译步骤直接上传已存在war包到指定的远程服务器"
	echo " -h                              帮助"
	echo " -l                              自动编译打包本地部署"
	echo " -r <server_flag>                自动编译打包远程部署到指定的远程服务器"
}

##############################################################################
###				变量声明 var=value 等号必须前后紧挨着
##############################################################################

project_base_path=""

##############################################################################
###			读取配置文件
##############################################################################
function read_conf(){
	echo "#################读取配置文件开始#################"
	while read -r line;do
    	eval "$line"
	done < /home/bear/project/atb_node/config

  project_base_path=${config_local_project_basepath}

  printConfigParam
	return 0
}


##############################################################################
###				输出参数详情
##############################################################################
function echo_params(){


	echo ""
}

##############################################################################
###			打印配置参数
##############################################################################
function printConfigParam(){
  echo "config Param: remote_server_paths = ${project_base_path}"
	echo "#################读取配置文件结束#################"
	echo ""
}

#读取配置文件
read_conf



#命令及参数显示
for i in "$*"; do
    echo "Command: `basename $0`" $i "Param Count: $#"
done

##############################################################################
###				检查入参是否是数字
##############################################################################
function check_num(){
	echo $1 | sed 's/[0-9]//g'
}
